# print("Hello world!")
#
# c = {"a": 2, "b": 3, "c": 1}
# d = {"a": 3, "b": 5, "e": 10}
# r = {}
# # for key, value in (*c.items(), *d.items()):
#     # r[key] = r.get(key, []) + [value]
#     # print(r)
# # print(r)
#
# for key, value in c.items():
#     if key in d:
#         c[key].extend(value)
#     else:
#         c[key] = value
# print(c)

# На обработку поступает натуральное число. Нужно написать программу, которая выводит на экран максимальную цифру числа,
# кратную 33. Если в числе нет цифр, кратных 33, требуется на экран вывести «NO».
# Программист торопился и написал программу неправильно.

# for hours in range(24):
#     for minutes in range(60):
#         for seconds in range(60):
#             print(hours, ':', minutes, ':', seconds)


# словарь с функциями



